nortismo/LoRaMac-node/src/boards/Tardigrade/configs/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Enables the clock for the Input Mux.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t gpio0_pin36_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin 36)  */
    GPIO_PinInit(GPIO, 0U, 0U, &gpio0_pin36_config);

    gpio_pin_config_t RADIO_NSS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin 2)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_NSS_GPIO, BOARD_INITPINS_RADIO_NSS_PORT, BOARD_INITPINS_RADIO_NSS_PIN, &RADIO_NSS_config);

    gpio_pin_config_t gpio0_pin55_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_4 (pin 55)  */
    GPIO_PinInit(GPIO, 0U, 4U, &gpio0_pin55_config);

    gpio_pin_config_t gpio0_pin56_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_5 (pin 56)  */
    GPIO_PinInit(GPIO, 0U, 5U, &gpio0_pin56_config);

    gpio_pin_config_t RADIO_ANT_SW_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 57)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_ANT_SW_GPIO, BOARD_INITPINS_RADIO_ANT_SW_PORT, BOARD_INITPINS_RADIO_ANT_SW_PIN, &RADIO_ANT_SW_config);

    gpio_pin_config_t gpio0_pin17_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin 17)  */
    GPIO_PinInit(GPIO, 0U, 8U, &gpio0_pin17_config);

    gpio_pin_config_t gpio0_pin37_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_9 (pin 37)  */
    GPIO_PinInit(GPIO, 0U, 9U, &gpio0_pin37_config);

    gpio_pin_config_t gpio0_pin14_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin 14)  */
    GPIO_PinInit(GPIO, 0U, 15U, &gpio0_pin14_config);

    gpio_pin_config_t gpio0_pin7_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 7)  */
    GPIO_PinInit(GPIO, 0U, 16U, &gpio0_pin7_config);

    gpio_pin_config_t RADIO_RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 3)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_RESET_GPIO, BOARD_INITPINS_RADIO_RESET_PORT, BOARD_INITPINS_RADIO_RESET_PIN, &RADIO_RESET_config);

    gpio_pin_config_t gpio0_pin38_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 38)  */
    GPIO_PinInit(GPIO, 0U, 18U, &gpio0_pin38_config);

    gpio_pin_config_t gpio0_pin49_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin 49)  */
    GPIO_PinInit(GPIO, 0U, 21U, &gpio0_pin49_config);

    gpio_pin_config_t GNSS_RESET_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 50)  */
    GPIO_PinInit(BOARD_INITPINS_GNSS_RESET_GPIO, BOARD_INITPINS_GNSS_RESET_PORT, BOARD_INITPINS_GNSS_RESET_PIN, &GNSS_RESET_config);

    gpio_pin_config_t gpio0_pin12_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 12)  */
    GPIO_PinInit(GPIO, 0U, 23U, &gpio0_pin12_config);

    gpio_pin_config_t gpio0_pin45_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_24 (pin 45)  */
    GPIO_PinInit(GPIO, 0U, 24U, &gpio0_pin45_config);

    gpio_pin_config_t gpio0_pin40_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin 40)  */
    GPIO_PinInit(GPIO, 0U, 26U, &gpio0_pin40_config);

    gpio_pin_config_t gpio0_pin18_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_27 (pin 18)  */
    GPIO_PinInit(GPIO, 0U, 27U, &gpio0_pin18_config);

    gpio_pin_config_t gpio0_pin15_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_31 (pin 15)  */
    GPIO_PinInit(GPIO, 0U, 31U, &gpio0_pin15_config);

    gpio_pin_config_t RADIO_BUSY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_0 (pin 4)  */
    GPIO_PinInit(BOARD_INITPINS_RADIO_BUSY_GPIO, BOARD_INITPINS_RADIO_BUSY_PORT, BOARD_INITPINS_RADIO_BUSY_PIN, &RADIO_BUSY_config);

    gpio_pin_config_t gpio1_pin39_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin 39)  */
    GPIO_PinInit(GPIO, 1U, 1U, &gpio1_pin39_config);

    gpio_pin_config_t gpio1_pin41_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin 41)  */
    GPIO_PinInit(GPIO, 1U, 2U, &gpio1_pin41_config);

    gpio_pin_config_t gpio1_pin42_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin 42)  */
    GPIO_PinInit(GPIO, 1U, 3U, &gpio1_pin42_config);
    /* PIO0_28 is selected for PINT input 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_GpioPort0Pin28ToPintsel);
    /* PIO0_25 is selected for PINT input 1 */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_GpioPort0Pin25ToPintsel);

